In [1]:
!pip install sqlalchemy pymysql

Requirement already satisfied: sqlalchemy in c:\users\lecturer\anaconda3\lib\site-packages (1.4.39)
Collecting pymysql
  Obtaining dependency information for pymysql from https://files.pythonhosted.org/packages/e5/30/20467e39523d0cfc2b6227902d3687a16364307260c75e6a1cb4422b0c62/PyMySQL-1.1.0-py3-none-any.whl.metadata
  Downloading PyMySQL-1.1.0-py3-none-any.whl.metadata (4.4 kB)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\lecturer\anaconda3\lib\site-packages (from sqlalchemy) (2.0.1)
Downloading PyMySQL-1.1.0-py3-none-any.whl (44 kB)
   ---------------------------------------- 0.0/44.8 kB ? eta -:--:--
   ------------------------------------ --- 41.0/44.8 kB 960.0 kB/s eta 0:00:01
   ---------------------------------------- 44.8/44.8 kB 734.6 kB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.0

In [2]:
import pandas as pd
import sqlalchemy
import pymysql

In [3]:
user = "pda2024"
password = "pda2024"
host = "127.0.0.1"
database = "companies"
# port = 3306

In [ ]:
# https://moodle.cct.ie/my/courses.php

In [4]:
sqlEngine = sqlalchemy.create_engine(f"mysql+pymysql://{user}:{password}@{host}")

In [5]:
conn = sqlEngine.connect()

In [6]:
conn.execute("CREATE DATABASE IF NOT EXISTS companies;")

In [7]:
conn.execute("USE companies;")

In [8]:
motorola_df = pd.read_csv("Motorola.csv")

In [9]:
motorola_df.head()

   Year   Company  Revenue (in millions)  Profit (in millions)
0  1955  Motorola                  205.2                   7.6
1  1956  Motorola                  226.7                   8.5
2  1957  Motorola                  227.6                   8.0
3  1958  Motorola                  226.4                   7.8
4  1959  Motorola                  216.6                   7.4

In [10]:
motorola_df.to_sql("motorola", conn, index=False) # (table_name, conn, index?)

51

In [11]:
pepsico_df = pd.read_sql("SELECT * FROM pepsico;", conn)

In [12]:
pepsico_df.head()

   year  Company  revenue_in_millions  profit_in_millions
0  1955  PepsiCo                 74.0                 6.0
1  1956  PepsiCo                 89.0                10.0
2  1957  PepsiCo                 97.0                 9.0
3  1958  PepsiCo                119.0                10.0
4  1959  PepsiCo                137.0                12.0

In [13]:
conn.close()

## Exercise
Create a new table called all_companies

Save the data from all 5 companies to this table

In [14]:
import os

In [16]:
os.listdir("companies")

['Exxon Mobil.csv',
 'General Electric.csv',
 'General Motors.csv',
 'Motorola.csv',
 'Pepsico.csv']

In [17]:
sqlEngine = sqlalchemy.create_engine(f"mysql+pymysql://{user}:{password}@{host}")
conn = sqlEngine.connect()

In [21]:
conn.execute("USE companies;")

In [23]:
conn.execute("CREATE TABLE all_companies (year INT, name TEXT, revenue DOUBLE, profit DOUBLE);")

In [28]:
conn.execute("DROP TABlE all_companies;")

In [29]:
all_companies = []
for company in os.listdir("companies"):
    all_companies.append(pd.read_csv("companies/" + company))

all_companies_df = pd.concat(all_companies)
all_companies_df.to_sql("all_companies", conn, index=False)

255